'use strict';
/*
    Задание 2
    Реализуйте класс ExtendedDate, унаследовав его от стандартного класса Date и добавив следующие возможности:
    ■ метод для вывода даты (числа и месяца) текстом;
    ■ метод для проверки – это прошедшая дата или будущая (если прошедшая, то метод возвращает false;
    если будущая или текущая, то true);
    ■ метод для проверки – високосный год или нет;
    ■ метод, возвращающий следующую дату.
    Создайте объект класса ExtendedDate и выведите на экран результаты работы новых методов.
 */