'use strict';
/*
    Задание 4
    Реализовать класс, описывающий блок html документ. Класс HtmlBlock должен содержать внутри себя:
    ■ коллекцию стилей, описанных с помощью класса CssClass;
    ■ корневой элемент, описанный с помощью класса HtmlElement;
    ■ метод getCode(), который возвращает строку с html кодом (сначала теги style с описанием всех классов, а потом
все html содержимое из корневого тега и его вложенных элементов).
    С помощью написанных классов реализовать следующий блок (см. рис. 2) и добавить его на страницу
с помощью document.write().
 */
